#+TITLE: darkman.el

=darkman.el= seamlessly integrates [[https://darkman.whynothugo.nl][Darkman]] with [[https://gnu.org/software/emacs][Emacs]] using the D-Bus protocol.

* Dependencies

- =dbus=: this package relies on the D-Bus protocol to control and
  communicate with the Darkman service.
- =darkman=: because that's what we're targeting.

* Installation

Begin by cloning the repository:

#+begin_src sh
git clone https://github.com/grtcdr/darkman.el darkman
#+end_src

Add the package to the =load-path= and then require it like so:

#+begin_src elisp
(add-to-list 'load-path "darkman")
(require 'darkman)
#+end_src

* Usage

** Automatically set the theme on startup

First, define which theme is associated with which mode (by default,
=modus-themes= are used) like so:

#+begin_src elisp
(setq darkman-themes '(:light tango :dark tango-dark))
#+end_src

Then, place this snippet in your configuration =init.el=:

#+begin_src elisp
(load-theme (darkman-get-theme))
#+end_src

=darkman-get-theme= returns a theme based on the current darkman mode
and the themes you specified in the =darkman-themes= variable.

** Automatically switch themes when the mode changes

=darkman.el= is able to listen to darkman's signals and changes the
theme without requiring you to manually create any scripts, you can
enable this behavior by enabling the minor mode:

#+begin_src elisp
(darkman-mode)
#+end_src

Your themes will now be automatically changed as soon as darkman
switches modes.

** Other functions

You can use =M-x darkman-toggle= to toggle the mode of the darkman service
from within Emacs.

Additionally, you can use =(darkman-set MODE)= and =(darkman-get)= to
manually set and get the mode of the darkman service respectively.

* Debugging

** Nothing's working?

*** Is D-Bus running?

Use your service manager to verify whether the =dbus= service is
running, here's an example using =systemd=:

#+begin_src sh :results raw
systemctl status dbus
#+end_src

#+RESULTS:
● dbus.service - D-Bus System Message Bus
     Loaded: loaded
     Active: *active* (running)

*** Is Darkman running?

Use your service manager to verify whether the =darkman= service is
running, here's an example using =systemd=:

#+begin_src sh :results raw
systemctl status --user darkman
#+end_src

#+RESULTS:
● darkman.service - Framework for dark-mode and light-mode transitions.
     Loaded: loaded
     Active: *active* (running)

*** Is Emacs built with D-Bus support?

Usually it is, unless you're building from source, in which case you
can determine whether or not Emacs was built with D-Bus support like
so:

#+begin_src elisp
(numberp (string-match "DBUS" system-configuration-features))
#+end_src

If non-nil, your Emacs /was/ built with D-Bus support.

* Citing

You may cite this project in your research like so:

#+begin_src bibtex
@misc{ABA:darkman,
  author = {Aziz Ben Ali},
   title = {Darkman integration with Emacs},
     url = {https://github.com/grtcdr/darkman.el},
    year = 2023
}
#+end_src
